const themes = {
    "Оформление и отправка": {
        "Как узнать индекс": `От правильности написания индекса зависит скорость доставки. Индекс совпадает с номером почтового отделения, за которым закреплен почтовый адрес. 
Есть несколько способов узнать индекс: \r\n
Введите нужный адрес в поисковике отделений на сайте \r\n
Укажите адрес при оформлении нужного вам бланка на сайте, и индекс определится автоматически \r\n
Воспользуйтесь мобильным приложением. В приложении вы сможете сохранять индексы под разными названиями \r\n
Позвоните на горячую линию 8-800-1-000-000 и сообщите оператору город, улицу и номер дома.`,
        "Наложенный платеж": `Наложенный платеж — сумма, которую адресат должен оплатить при получении письма или посылки в почтовом отделении. После оплаты получателем, сумма наложенного платежа перечисляется отправителю почтовым переводом. За перевод взимается плата в соответствии с тарифами почтового перевода. \r\n
С наложенным платежом можно отправить только регистрируемые отправления с объявленной ценностью. При этом сумма наложенного платежа не может превышать сумму объявленной ценности. \r\n
Получатель может отказаться от получения отправления (тогда оно возвращается отправителю). \r\n
Получателем наложенного платежа может быть как физическое лицо, так и юридическое. За наложенный платеж в адрес получателя-физического лица плата взимается в соответствии с установленными тарифами. \r\n
Оплата получателем наложенного платежа в отделении почтовой связи и при доставке курьером возможна как наличными, так и банковской картой.`,
        "Сколько посылка или письмо хранятся в отделении?": `Срок хранения внутренних и международных посылок, отправлений EMS и крупногабаритных почтовых отправлений составляет 15 дней. \r\n 
Почтовые переводы и письменная корреспонденция, в т.ч. мелкие пакеты хранятся в отделении 30 дней. Отправления с пометками «Судебное» и «Административное» – 7 дней. \r\n
Исчисление срока хранения начинается со следующего рабочего дня ОПС, следующего за днем поступления отправления или почтового перевода в место вручения.`,
        "Как упаковать и отправить посылку?": `Содержимое посылки не должно перемещаться внутри упаковки – для этого свободное пространство заполняют бумагой, газетой и так далее. \r\n
Посылки могут быть упакованы в коробки или пластиковые пакеты соответствующих размеров. При опечатывании посылок убедитесь в том, что доступ к вложению невозможен. \r\n
На упаковке должно быть место для наклеивания адресного ярлыка. \r\n
Максимальный вес посылок, отправляемых 1 классом — 5 кг., а сумма трех измерений сторон не более 70 см.`,
        "Как получить отправление с помощью СМС?": `Получайте отправления без документов — паспорта и извещения, по СМС-коду. \r\n
Для этого вам достаточно оформить простую электронную подпись одним из следующих способов: \r\n
1)  Подключите услугу дистанционно с помощью учетной записи ГосУслуг. \r\n
2)  Заполните анкету на сайте и подпишите ее в отделении Почты России (с собой необходимо взять паспорт). \r\n
3)  Придите в отделение Почты России с паспортом и заполните анкету.`,
        "Как отправить посылку по номеру телефона?": `Теперь необязательно указывать полный адрес получателя и знать его ФИО – вы можете быстро и удобно отправить посылку по номеру телефона! \r\n
Для этого достаточно ввести телефон адресата в формате "+7 хххххххххх" на сайте или в мобильном приложении Почты. \r\n
Сервис подключается бесплатно, за его использование не взимаются дополнительные денежные средства: отправитель оплачивает только стоимость посылки.`,
    },
    "Услуги в отделении": {
        "Выдача пенсий и пособий": `Через Почту России можно получать пенсию, пособия, субсидии, ежемесячные выплаты и компенсации наличными не выходя из дома. \r\n
Доставка осуществляется почтальонами бесплатно. Для того чтобы оформить получение пенсии через Почту России, вам следует подать заявление лично в территориальном органе ПФР или МФЦ, либо на сайте https://www.gosuslugi.ru/600109/1/form.`,
        "Общая информация об услугах в отделениях": `Во всех отделениях Почты России можно отправлять и получать письма,посылки и открытки, оформлять денежные переводы, покупать упаковочные материалы, пользоваться услугами упаковщика, оформлять подписку на газеты и журналы, получать пенсии и пособия, оплачивать услуги и штрафы, выплачивать кредиты, отправлять документы в вузы, покупать марки и маркированные конверты, отправлять официальные запросы в госорганы и миграционные уведомления.`,
        "Как оставить жалобу или претензию? ": `Обращение по качеству оказания услуг в отделении почтовой связи можно оформить на странице https://www.pochta.ru/claim, оставить в мобильном приложении, либо оформить непосредственно в отделении Почты России. \r\n
Претензионное заявление по российским и международным отправлениям можно оформить на странице https://www.pochta.ru/claim, при условии подтверждения личности через ЕСИА (портал Госуслуг). \r\n
В случае отсутствия регистрации на портале Госуслуг бланк претензионного заявления на розыск отправления по России или международного отправления, заполненный в электронном виде, можно распечатать и подать в отделении Почты России.`
    },
    "Рекламные услуги для бизнеса": {
        "Рекламные рассылки": `С помощью Почты России можно осуществить рекламную рассылку по почтовым ящикам. \r\n
Таргетированная рекламная рассылка - рассылка адресатам, выбранным из базы данных Почты России по нужным вашему бизнесу параметрам (возраст, пол, регион проживания, интересы и другое). Также подойдет для рассылки по вашей собственной базе адресов. \r\n
Локальная рекламная рассылка - если вам нужно рассказать о вашем бизнесе жителям определенного района — Почта России разошлет рекламу по почтовым ящикам нужных вам домов. \r\n
Федеральная рекламная рассылка - для крупных розничных сетей — массовая рассылка по двум и более регионам России.`,
        "Размещение рекламы в отделениях": `Вы можете разместить вашу рекламу в отделениях Почты России. Рекламу можно разместить в 15 000 отделений по всей России. Вы можете выбрать те отделения, которые вам подходят. \r\n
Доступные рекламные форматы — плакат А3. В некоторых отделениях можно разместить несколько плакатов. \r\n
Рекламные материалы должны соответствовать закону «О рекламе» и не предлагать услуг, конкурирующих с услугами Почты России.`,
        "SMS/Email-рассылки": `Почта России предлагает организацию массовых e-mail и SMS-рассылок. \r\n
В базе Почты — более 20 млн клиентов с согласием на коммуникацию (в соответствии с 152-ФЗ о персональных данных). Рассылка может быть таргетирована по местоположению и социально-демографическим характеристикам получателей. \r\n
Коммуникация в партнёрстве с Почтой России повысит доверие к вашему бренду, а добавление UTM-метки позволит оценить эффективность и конверсию.`,
    }
}

function getQuestionByThemeName (name) {
    return Object.keys(themes[name]);
}

function getThemes () {
    return Object.keys(themes);
}

function getAnswer (theme, question) {
    return themes[theme][question];
}

module.exports = {
    getThemes,
    getQuestionByThemeName,
    getAnswer,
    themes
};